# 02: Organizing data into Series and DataFrames with Pandas

Pandas is another essential package for data analysis and machine learning. While we won't be using is as much in Deep learning, it is still important to know how to use it for loading data files and for data processing and wrangling. It comes with two main data structures: Series and DataFrame. A Series is like a dictionary with keys (also called indexes) and values. A DataFrame represents tabular data with one or more columns.

To use pandas, we first need to import it. Let's also import NumPy.

In [1]:
import numpy as np
import pandas as pd

We can now create series and dataframes.

## Series
A series is a one-dimensional narray with axis labels (or indexes).

### Creating a series
We can create a series by providing an array of values.

In [2]:
s1 = pd.Series([10,20,30,40,50])
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

Since we did not provide indexes for our data, numeric zero-based indexes (much like those for arrays) will be automatically provided.

We can also create a series by providing custom indexes.

In [3]:
s2 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

Notice that indexes are not required to be unique. For example, we can create a Series with duplicate indexes.

In [4]:
s3 = pd.Series([1,2,3,4,5], index=['a','b','b','c','c']) 
print(s3)

a    1
b    2
b    3
c    4
c    5
dtype: int64

We can create a series from NumPy arrays.

In [5]:
snp = pd.Series(np.arange(2, 11, 2), index=['A','B','C','D','F']) 
print(snp)

A     2
B     4
C     6
D     8
F    10
dtype: int64

And indexes could be ranges.

In [6]:
s4 = pd.Series(np.arange(2, 11, 2), index=np.arange(1, 6)) 
print(s4)

1     2
2     4
3     6
4     8
5    10
dtype: int64

### Accessing elements in a series (Indexing)

We can use the indexes to extract and/or slice elements within a series. For example, given the series `s1`:

In [7]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

Here is the element at index 0:

In [8]:
s1[0]

10

and the elements at indexes 2 and 3:

In [9]:
s1[[2,3]]

2    30
3    40
dtype: int64

or at the index range from 2 up to but not equal to 4

In [10]:
s1[2:4]

2    30
3    40
dtype: int64

And given the series `s2`:

In [11]:
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

Here is the element at index 'c':

In [12]:
s2['c']

3

and here are the elements from index 'b' to index 'd'

In [13]:
s2['b':'d']

b    2
c    3
d    4
dtype: int64

And for a series with duplicate indexes such as:

In [14]:
s3

a    1
b    2
b    3
c    4
c    5
dtype: int64

Using a duplicate index returns a series of all the elements with that index.

In [15]:
s3['b']

b    2
b    3
dtype: int64

The above use of indexes is the same as using `.loc[]` with indexes between `[` and `]`. That is

In [16]:
print(snp['A':'D'])
print(s3['b'])

A    2
B    4
C    6
D    8
dtype: int64
b    2
b    3
dtype: int64

is the same as:

In [17]:
print(snp.loc['A':'D'])
print(s3.loc['b'])

A    2
B    4
C    6
D    8
dtype: int64
b    2
b    3
dtype: int64

But sometimes we want to use the position of the index rather than its actual value to access elements within a series. We can use `.iloc[]` with zero-based numeric indexes positions between `[` and `]`. The position 0 means the first index. For example, given the Series:

In [18]:
snp

A     2
B     4
C     6
D     8
F    10
dtype: int64

We can access its first element:

In [19]:
snp.iloc[0]

2

And its last element:

In [20]:
snp.iloc[snp.size - 1]

10

### Slicing a series
With `.iloc`, we can index and slice a series in exactly the same way we did in a one-dimensional NumPy array. Here is, for example, how you select every other element in a Series.

In [21]:
snp.iloc[0::2]

A     2
C     6
F    10
dtype: int64

And speaking of NumPy, we can extract the values of a series as a NumPy array.

In [22]:
snp.values

array([ 2,  4,  6,  8, 10])

We can also extract its indexes as an array also:

In [23]:
snp.index

Index(['A', 'B', 'C', 'D', 'F'], dtype='object')

### An example using a series
To show how useful series can be, here is an example series with random values and `A` to `Z` keys.

In [24]:
s = pd.Series(np.random.randn(26), index=[chr(65 + c) for c in range(26)])
s

A    0.252667
B    0.732682
C    1.472765
D   -0.587280
E   -0.304544
F   -0.629237
G    1.767808
H   -0.966587
I   -0.520488
J    0.846570
K   -0.595373
L   -0.344268
M   -0.815882
N   -0.518733
O    0.258134
P   -0.740938
Q    1.606480
R    1.501638
S   -0.651595
T   -0.289723
U    2.035900
V   -0.633746
W   -0.596911
X    0.408341
Y    0.488841
Z   -0.374850
dtype: float64

We can sort this series descendingly like this:

In [25]:
s.sort_values(ascending=False)

U    2.035900
G    1.767808
Q    1.606480
R    1.501638
C    1.472765
J    0.846570
B    0.732682
Y    0.488841
X    0.408341
O    0.258134
A    0.252667
T   -0.289723
E   -0.304544
L   -0.344268
Z   -0.374850
N   -0.518733
I   -0.520488
D   -0.587280
K   -0.595373
W   -0.596911
F   -0.629237
V   -0.633746
S   -0.651595
P   -0.740938
M   -0.815882
H   -0.966587
dtype: float64

And here is how we get its top 5 elements:

In [26]:
s.sort_values(ascending=False).iloc[:5]

U    2.035900
G    1.767808
Q    1.606480
R    1.501638
C    1.472765
dtype: float64

And here is the index of the top element

In [27]:
s.idxmax()

'U'

Similarly, here is the index of the bottom element

In [28]:
s.idxmin()

'H'

And we can show next to each key the order of its element if the series is ascendingly sorted.

In [29]:
s.argsort()

A     7
B    12
C    15
D    18
E    21
F     5
G    22
H    10
I     3
J     8
K    13
L    25
M    11
N     4
O    19
P     0
Q    14
R    23
S    24
T     1
U     9
V     2
W    17
X    16
Y     6
Z    20
dtype: int64

This gives us another way to sort a series

In [30]:
s[s.argsort()][::-1]

U    2.035900
G    1.767808
Q    1.606480
R    1.501638
C    1.472765
J    0.846570
B    0.732682
Y    0.488841
X    0.408341
O    0.258134
A    0.252667
T   -0.289723
E   -0.304544
L   -0.344268
Z   -0.374850
N   -0.518733
I   -0.520488
D   -0.587280
K   -0.595373
W   -0.596911
F   -0.629237
V   -0.633746
S   -0.651595
P   -0.740938
M   -0.815882
H   -0.966587
dtype: float64

Notice that we used `[::-1]` to make this sort in descending order. Finally we cat extract the top 5 elements:

In [31]:
s[s.argsort()][::-1].iloc[:5]

U    2.035900
G    1.767808
Q    1.606480
R    1.501638
C    1.472765
dtype: float64

and the bottom five:

In [32]:
s[s.argsort()][::-1].iloc[-5:]

V   -0.633746
S   -0.651595
P   -0.740938
M   -0.815882
H   -0.966587
dtype: float64

## DataFrames
A data frame is a two-dimensional table with columns and rows. You can think of each column on a DataFrame as a series sharing the same indexes with the other columns. Each column has a name that can be used to access it.

### Creating DataFrames
The easiest way to create a DataFrame is by using a dictionary of arrays. The keys of this dictionary will become column names. Here is a DataFrame with 4 by 9 multiplication table.

In [33]:
mtable = pd.DataFrame({
    'byOne': [1,2, 3, 4, 5, 6, 7, 8, 9],
    'byTwo': [2, 4, 6, 8, 10, 12, 14, 16, 18],
    'byThree': [3, 6, 9, 12, 15, 18, 21, 24, 27],
    'byFour': [4, 8, 12, 16, 20, 24, 28, 32, 36]
})

mtable

   byOne  byTwo  byThree  byFour
0      1      2        3       4
1      2      4        6       8
2      3      6        9      12
3      4      8       12      16
4      5     10       15      20
5      6     12       18      24
6      7     14       21      28
7      8     16       24      32
8      9     18       27      36

Since we did not provide indexes, Pandas will create zero-based numeric indexes for us, just like it does for a Series.

We can use NumPy arrays to create the same table:

In [34]:
mtable = pd.DataFrame({
    'byOne': np.arange(1, 10),
    'byTwo': 2 * np.arange(1, 10),
    'byThree': 3 * np.arange(1, 10),
    'byFour': 4 * np.arange(1, 10)
})

print(mtable)

   byOne  byTwo  byThree  byFour
0      1      2        3       4
1      2      4        6       8
2      3      6        9      12
3      4      8       12      16
4      5     10       15      20
5      6     12       18      24
6      7     14       21      28
7      8     16       24      32
8      9     18       27      36

We can create a DataFrame from a two-dimensional array. Given an array,

In [35]:
table = np.array([
    np.arange(1, 10),
    2 * np.arange(1, 10),
    3 * np.arange(1, 10),
    4 * np.arange(1, 10)
]).T

print(table)

[[ 1  2  3  4]
 [ 2  4  6  8]
 [ 3  6  9 12]
 [ 4  8 12 16]
 [ 5 10 15 20]
 [ 6 12 18 24]
 [ 7 14 21 28]
 [ 8 16 24 32]
 [ 9 18 27 36]]

we can create a DataFrame from it.

In [36]:
mtable = pd.DataFrame(table)

mtable

   0   1   2   3
0  1   2   3   4
1  2   4   6   8
2  3   6   9  12
3  4   8  12  16
4  5  10  15  20
5  6  12  18  24
6  7  14  21  28
7  8  16  24  32
8  9  18  27  36

Since we did not provide column names or indexes, Pandas provided numeric zero-based column names and indexes for us. We can rename these columns by providing custom names for it after it was created.

In [37]:
mtable.columns= ['A', 'B', 'C', 'D']
mtable

   A   B   C   D
0  1   2   3   4
1  2   4   6   8
2  3   6   9  12
3  4   8  12  16
4  5  10  15  20
5  6  12  18  24
6  7  14  21  28
7  8  16  24  32
8  9  18  27  36

We can provide the column names at the time of creating the DataFrame.

In [38]:
mt = pd.DataFrame(table, columns=['byOne', 'byTwo', 'byThree', 'byFour'])

mt

   byOne  byTwo  byThree  byFour
0      1      2        3       4
1      2      4        6       8
2      3      6        9      12
3      4      8       12      16
4      5     10       15      20
5      6     12       18      24
6      7     14       21      28
7      8     16       24      32
8      9     18       27      36

We can also provide custom indexes.

In [39]:
mt = pd.DataFrame(table, 
                  columns=['byOne', 'byTwo', 'byThree', 'byFour'],
                  index=['x1', 'x2', 'x3', 'x4', 'x5', 'x6', 'x7', 'x8', 'x9'])

mt

    byOne  byTwo  byThree  byFour
x1      1      2        3       4
x2      2      4        6       8
x3      3      6        9      12
x4      4      8       12      16
x5      5     10       15      20
x6      6     12       18      24
x7      7     14       21      28
x8      8     16       24      32
x9      9     18       27      36

We can convert the contents of a DataFrame to a NumPy array:

In [40]:
mt.values

array([[ 1,  2,  3,  4],
       [ 2,  4,  6,  8],
       [ 3,  6,  9, 12],
       [ 4,  8, 12, 16],
       [ 5, 10, 15, 20],
       [ 6, 12, 18, 24],
       [ 7, 14, 21, 28],
       [ 8, 16, 24, 32],
       [ 9, 18, 27, 36]])

We can get its column names:

In [41]:
mt.columns

Index(['byOne', 'byTwo', 'byThree', 'byFour'], dtype='object')

and its indexes:

In [42]:
mt.index

Index(['x1', 'x2', 'x3', 'x4', 'x5', 'x6', 'x7', 'x8', 'x9'], dtype='object')

### Adding new columns and rows to an existing DataFrame
Given the DataFrame:

In [43]:
mt

    byOne  byTwo  byThree  byFour
x1      1      2        3       4
x2      2      4        6       8
x3      3      6        9      12
x4      4      8       12      16
x5      5     10       15      20
x6      6     12       18      24
x7      7     14       21      28
x8      8     16       24      32
x9      9     18       27      36

We can add a new column like this:

In [44]:
mt['byFive'] = 5 * np.arange(1, 10)

mt

    byOne  byTwo  byThree  byFour  byFive
x1      1      2        3       4       5
x2      2      4        6       8      10
x3      3      6        9      12      15
x4      4      8       12      16      20
x5      5     10       15      20      25
x6      6     12       18      24      30
x7      7     14       21      28      35
x8      8     16       24      32      40
x9      9     18       27      36      45

And using the `.loc`, we can add a new row like this:

In [45]:
mt.loc['x10'] = 10 * np.arange(1, 6)
mt

     byOne  byTwo  byThree  byFour  byFive
x1       1      2        3       4       5
x2       2      4        6       8      10
x3       3      6        9      12      15
x4       4      8       12      16      20
x5       5     10       15      20      25
x6       6     12       18      24      30
x7       7     14       21      28      35
x8       8     16       24      32      40
x9       9     18       27      36      45
x10     10     20       30      40      50

### Dropping a column or a row from a DataFrame
We can use the `drop` method to remove a column from a DataFrame. Let's remove the column `byFive` we added above:

In [46]:
mt.drop(['byFive'], axis=1)

     byOne  byTwo  byThree  byFour
x1       1      2        3       4
x2       2      4        6       8
x3       3      6        9      12
x4       4      8       12      16
x5       5     10       15      20
x6       6     12       18      24
x7       7     14       21      28
x8       8     16       24      32
x9       9     18       27      36
x10     10     20       30      40

Here `axis=1` refers to columns. To drop a row we use `axis=0` and provide a index instead of a column name.

In [47]:
mt.drop(['x10'], axis=0)

    byOne  byTwo  byThree  byFour  byFive
x1      1      2        3       4       5
x2      2      4        6       8      10
x3      3      6        9      12      15
x4      4      8       12      16      20
x5      5     10       15      20      25
x6      6     12       18      24      30
x7      7     14       21      28      35
x8      8     16       24      32      40
x9      9     18       27      36      45

### DataFrame indexing and slicing

We can use the column names and indexes to access individual cells.

In [48]:
mt['byTwo']['x5']

10

To extract a single column, use its name:

In [49]:
mt['byThree']

x1      3
x2      6
x3      9
x4     12
x5     15
x6     18
x7     21
x8     24
x9     27
x10    30
Name: byThree, dtype: int64

And use an array of column names to extract multiple columns

In [50]:
mt[['byTwo', 'byFour']]

     byTwo  byFour
x1       2       4
x2       4       8
x3       6      12
x4       8      16
x5      10      20
x6      12      24
x7      14      28
x8      16      32
x9      18      36
x10     20      40

Use `.loc` to access a specific row using its index:

In [51]:
mt.loc['x6']

byOne       6
byTwo      12
byThree    18
byFour     24
byFive     30
Name: x6, dtype: int64

Similarly we can extract rows using their index positions using `.iloc[]`. We can, for example extract the first row using the its index position `0` (the index itself is `x1`).

In [52]:
mt.iloc[0]

byOne      1
byTwo      2
byThree    3
byFour     4
byFive     5
Name: x1, dtype: int64

We can also use `.iloc` to access certain columns and rows based on their positions, much like the indexing and slicing of a two-dimensional NumPy array. Here is the whole DataFrame:

In [53]:
mt.iloc[:, :]

     byOne  byTwo  byThree  byFour  byFive
x1       1      2        3       4       5
x2       2      4        6       8      10
x3       3      6        9      12      15
x4       4      8       12      16      20
x5       5     10       15      20      25
x6       6     12       18      24      30
x7       7     14       21      28      35
x8       8     16       24      32      40
x9       9     18       27      36      45
x10     10     20       30      40      50

In the `[:, :]` expression, the first `:` refers to all rows and the second `:` refers to all columns.

Here is a slice from the third(position 2) row to the sixth (position 5) and from the second column (position 1) to the fifth column(position 4).

In [54]:
mt.iloc[2:5, 1:4]

    byTwo  byThree  byFour
x3      6        9      12
x4      8       12      16
x5     10       15      20

And here is every other column and row.

In [55]:
mt.iloc[::2, ::2]

    byOne  byThree  byFive
x1      1        3       5
x3      3        9      15
x5      5       15      25
x7      7       21      35
x9      9       27      45

Finally we can use the methods `head` and `tail` to display the first couple of rows at the top or the bottom of a DataFrame. This is useful for exploring large dataframes.

In [56]:
print(mt.head())
print(mt.head(6))

print(mt.tail())
print(mt.tail(7))

    byOne  byTwo  byThree  byFour  byFive
x1      1      2        3       4       5
x2      2      4        6       8      10
x3      3      6        9      12      15
x4      4      8       12      16      20
x5      5     10       15      20      25
    byOne  byTwo  byThree  byFour  byFive
x1      1      2        3       4       5
x2      2      4        6       8      10
x3      3      6        9      12      15
x4      4      8       12      16      20
x5      5     10       15      20      25
x6      6     12       18      24      30
     byOne  byTwo  byThree  byFour  byFive
x6       6     12       18      24      30
x7       7     14       21      28      35
x8       8     16       24      32      40
x9       9     18       27      36      45
x10     10     20       30      40      50
     byOne  byTwo  byThree  byFour  byFive
x4       4      8       12      16      20
x5       5     10       15      20      25
x6       6     12       18      24      30
x7       7     14       21      28      35
x8       8     16       24      32      40
x9       9     18       27      36      45
x10     10     20       30      40      50

### Summarizing dataframes
Given the following 50 by 10 DataFrame:

In [57]:
data = pd.DataFrame(np.random.randn(50,10), columns=list('ABCDEFGHIJ'))

In [58]:
data.head()

,A,B,C,D,E,F,G,H,I,J
0,0.733276,-0.342386,1.410603,-2.154478,0.654737,0.995158,-0.720911,-1.433215,-0.398798,-2.220342
1,-1.116380,-0.666719,0.268802,-2.159837,0.013830,2.060263,0.971307,-0.289935,0.743694,0.292744
2,0.126154,-0.143216,-1.100917,-0.829872,-0.038187,-1.418361,-0.486728,-0.354431,0.198931,-1.691048
3,0.333132,-0.419473,1.596589,0.981824,0.856074,1.070598,1.215529,1.604969,0.601560,-0.963667
4,0.064683,0.520477,0.461204,0.471319,0.734359,-1.086613,-0.514328,-1.594676,-1.134257,1.026236

We can statistically summarize it like this:

In [59]:
data.describe()

,A,B,C,D,E,F,G,H,I,J
count,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000
mean,0.136994,-0.157965,0.075888,-0.080505,-0.022497,0.075718,-0.216367,0.015642,0.205468,-0.348042
std,0.796087,1.100161,0.967628,0.985961,0.968178,1.069319,1.018116,1.059452,1.065991,1.055660
min,-1.633764,-2.544412,-2.101232,-2.159837,-3.056763,-1.981979,-2.551686,-2.504076,-2.378567,-2.331976
25%,-0.456141,-0.930337,-0.595108,-0.594173,-0.581671,-0.714300,-0.840429,-0.458878,-0.426018,-1.211790
50%,0.124862,-0.212005,-0.000287,-0.082506,0.187804,0.267962,-0.276535,-0.073380,0.271782,-0.295711
75%,0.547554,0.700434,0.749413,0.603904,0.614059,1.014072,0.364931,0.576492,0.802124,0.359248
max,2.167681,1.917787,2.349986,2.125029,1.890325,2.374692,1.853143,2.545375,2.471372,1.960140

We can also get the means of each column:

In [60]:
data.mean()

A    0.136994
B   -0.157965
C    0.075888
D   -0.080505
E   -0.022497
F    0.075718
G   -0.216367
H    0.015642
I    0.205468
J   -0.348042
dtype: float64

and the variances of each column:

In [61]:
data.var()

A    0.633755
B    1.210355
C    0.936304
D    0.972118
E    0.937368
F    1.143443
G    1.036559
H    1.122438
I    1.136337
J    1.114418
dtype: float64

and the standard deviations of each column:

In [62]:
data.std()

A    0.796087
B    1.100161
C    0.967628
D    0.985961
E    0.968178
F    1.069319
G    1.018116
H    1.059452
I    1.065991
J    1.055660
dtype: float64

### Transposing DataFrames
We can transpose a DataFrame by making columns rows and rows columns. That means also reversing columns and indexes.

In [63]:
data.transpose()

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
A,0.733276,-1.116380,0.126154,0.333132,0.064683,0.006065,-0.451067,0.793895,-0.367421,0.511576,...,-0.127289,1.386916,-1.633764,-0.974898,-0.805384,2.167681,1.243792,-0.002651,1.370340,1.023001
B,-0.342386,-0.666719,-0.143216,-0.419473,0.520477,-0.191524,0.888718,1.917787,-2.544412,-0.486788,...,-1.543062,1.077196,1.870108,0.270026,-0.668787,-1.100380,0.985446,-1.229402,0.169511,0.423487
C,1.410603,0.268802,-1.100917,1.596589,0.461204,-1.316004,-0.003955,-0.921154,-0.344344,-0.497416,...,0.239693,1.162950,1.662220,0.979987,0.772296,0.533268,0.569719,0.680762,-0.239325,0.197074
D,-2.154478,-2.159837,-0.829872,0.981824,0.471319,0.598464,-0.615739,1.252801,-1.033376,-0.409094,...,0.542043,1.854790,0.124664,0.484717,2.125029,0.900856,-0.092572,-0.251256,0.660928,-0.215814
E,0.654737,0.013830,-0.038187,0.856074,0.734359,-3.056763,-1.758991,0.496039,1.890325,0.356346,...,-0.900169,-1.423037,-0.776872,-0.592344,1.175373,-0.699760,-0.549652,0.192459,0.640765,-0.975127
F,0.995158,2.060263,-1.418361,1.070598,-1.086613,-0.121031,1.036380,-0.515465,1.498709,-1.127487,...,0.462129,-1.242636,-1.930470,0.549805,0.589815,0.310757,-1.594772,-0.028148,-1.447598,1.073154
G,-0.720911,0.971307,-0.486728,1.215529,-0.514328,-1.039120,-1.432710,-0.669876,1.853143,0.471774,...,1.297018,1.471130,0.227253,-1.698260,0.172036,-1.203033,0.130750,-1.162484,0.281780,-0.868174
H,-1.433215,-0.289935,-0.354431,1.604969,-1.594676,-0.063332,-0.459441,-0.422471,0.209210,-0.553113,...,-2.504076,0.746912,0.420625,0.251529,-0.562165,1.146754,-0.691448,-0.028599,-1.299028,0.294979
I,-0.398798,0.743694,0.198931,0.601560,-1.134257,-2.378567,0.773482,0.679219,-1.872613,1.101409,...,0.493986,-1.161466,1.243637,0.003929,-1.106539,-0.427338,-0.353610,-0.806033,0.593355,0.963904
J,-2.220342,0.292744,-1.691048,-0.963667,1.026236,-1.448463,0.381414,-0.215486,1.018072,-0.315717,...,-0.044944,0.713487,1.007528,-0.145274,1.242830,-1.187539,-1.283865,-0.643818,-1.301934,1.174762

which is the same as:

In [64]:
data.T

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
A,0.733276,-1.116380,0.126154,0.333132,0.064683,0.006065,-0.451067,0.793895,-0.367421,0.511576,...,-0.127289,1.386916,-1.633764,-0.974898,-0.805384,2.167681,1.243792,-0.002651,1.370340,1.023001
B,-0.342386,-0.666719,-0.143216,-0.419473,0.520477,-0.191524,0.888718,1.917787,-2.544412,-0.486788,...,-1.543062,1.077196,1.870108,0.270026,-0.668787,-1.100380,0.985446,-1.229402,0.169511,0.423487
C,1.410603,0.268802,-1.100917,1.596589,0.461204,-1.316004,-0.003955,-0.921154,-0.344344,-0.497416,...,0.239693,1.162950,1.662220,0.979987,0.772296,0.533268,0.569719,0.680762,-0.239325,0.197074
D,-2.154478,-2.159837,-0.829872,0.981824,0.471319,0.598464,-0.615739,1.252801,-1.033376,-0.409094,...,0.542043,1.854790,0.124664,0.484717,2.125029,0.900856,-0.092572,-0.251256,0.660928,-0.215814
E,0.654737,0.013830,-0.038187,0.856074,0.734359,-3.056763,-1.758991,0.496039,1.890325,0.356346,...,-0.900169,-1.423037,-0.776872,-0.592344,1.175373,-0.699760,-0.549652,0.192459,0.640765,-0.975127
F,0.995158,2.060263,-1.418361,1.070598,-1.086613,-0.121031,1.036380,-0.515465,1.498709,-1.127487,...,0.462129,-1.242636,-1.930470,0.549805,0.589815,0.310757,-1.594772,-0.028148,-1.447598,1.073154
G,-0.720911,0.971307,-0.486728,1.215529,-0.514328,-1.039120,-1.432710,-0.669876,1.853143,0.471774,...,1.297018,1.471130,0.227253,-1.698260,0.172036,-1.203033,0.130750,-1.162484,0.281780,-0.868174
H,-1.433215,-0.289935,-0.354431,1.604969,-1.594676,-0.063332,-0.459441,-0.422471,0.209210,-0.553113,...,-2.504076,0.746912,0.420625,0.251529,-0.562165,1.146754,-0.691448,-0.028599,-1.299028,0.294979
I,-0.398798,0.743694,0.198931,0.601560,-1.134257,-2.378567,0.773482,0.679219,-1.872613,1.101409,...,0.493986,-1.161466,1.243637,0.003929,-1.106539,-0.427338,-0.353610,-0.806033,0.593355,0.963904
J,-2.220342,0.292744,-1.691048,-0.963667,1.026236,-1.448463,0.381414,-0.215486,1.018072,-0.315717,...,-0.044944,0.713487,1.007528,-0.145274,1.242830,-1.187539,-1.283865,-0.643818,-1.301934,1.174762

### Shuffling a DataFrame
You can shuffle a DataFrame using the `sample` method. If you give it a number less than the length of the DataFrame, a random sample (without replacement by default) of that length will be returned. If you give it the length of the DataFrame, a shuffled version of the DataFrame will be returned.

In [65]:
shuffled = data.sample(len(data))
shuffled.head(10)

,A,B,C,D,E,F,G,H,I,J
28,-0.457833,0.704938,-0.788668,-0.471618,0.729784,1.589584,-0.033800,0.544194,0.423154,0.154120
3,0.333132,-0.419473,1.596589,0.981824,0.856074,1.070598,1.215529,1.604969,0.601560,-0.963667
8,-0.367421,-2.544412,-0.344344,-1.033376,1.890325,1.498709,1.853143,0.209210,-1.872613,1.018072
45,2.167681,-1.100380,0.533268,0.900856,-0.699760,0.310757,-1.203033,1.146754,-0.427338,-1.187539
29,-0.769728,-1.020930,1.251192,0.286040,0.476663,-0.282371,-0.354040,0.364894,0.165637,1.960140
36,0.122078,1.040790,-1.026396,0.216167,-0.477794,-1.250743,-0.556717,1.798610,-0.946902,-0.424860
16,-0.784183,-1.361069,-0.575494,-1.233600,0.677226,2.374692,-0.217183,1.404554,2.471372,1.021371
31,-0.024723,-0.735439,-1.065051,-0.444326,-0.162541,1.325927,1.771526,-0.600173,1.804098,-2.331976
10,1.462105,-1.016306,-0.962941,0.813503,-0.790614,-0.719437,-0.152561,-0.333220,1.245346,-1.219873
7,0.793895,1.917787,-0.921154,1.252801,0.496039,-0.515465,-0.669876,-0.422471,0.679219,-0.215486

To avoid reshuffling the indexes, use the `ignore_index=` parameter

In [66]:
shuffled = data.sample(len(data), ignore_index=True)
shuffled.head(10)

,A,B,C,D,E,F,G,H,I,J
0,2.167681,-1.100380,0.533268,0.900856,-0.699760,0.310757,-1.203033,1.146754,-0.427338,-1.187539
1,-0.367421,-2.544412,-0.344344,-1.033376,1.890325,1.498709,1.853143,0.209210,-1.872613,1.018072
2,1.243792,0.985446,0.569719,-0.092572,-0.549652,-1.594772,0.130750,-0.691448,-0.353610,-1.283865
3,-0.002651,-1.229402,0.680762,-0.251256,0.192459,-0.028148,-1.162484,-0.028599,-0.806033,-0.643818
4,0.290662,0.581849,-0.883260,-0.523899,0.317947,1.032122,-1.624927,-1.303665,1.782966,-0.259326
5,-0.024723,-0.735439,-1.065051,-0.444326,-0.162541,1.325927,1.771526,-0.600173,1.804098,-2.331976
6,1.121538,-0.232486,0.778694,0.659951,-0.860736,-0.115027,-0.750742,-0.353585,1.783903,0.330824
7,-0.611594,-0.300625,-0.089564,-0.510516,0.095604,-1.422911,-1.943627,0.492276,-0.536279,-1.181425
8,0.630485,-1.946614,0.151392,-0.072440,1.664276,0.280054,-0.329528,-0.083428,-0.067882,0.131554
9,-0.721305,-0.275391,-1.494297,-1.482229,-0.153464,1.122138,-1.104885,-1.812210,1.668608,-1.383968

### Sorting a DataFrame

We can sort indexes, column names, or the values of a DataFrame. For example, the following sorts the indexes (`axis=0`) of the DataFrame in an ascending order:

In [67]:
mt.sort_index(axis=0)

     byOne  byTwo  byThree  byFour  byFive
x1       1      2        3       4       5
x10     10     20       30      40      50
x2       2      4        6       8      10
x3       3      6        9      12      15
x4       4      8       12      16      20
x5       5     10       15      20      25
x6       6     12       18      24      30
x7       7     14       21      28      35
x8       8     16       24      32      40
x9       9     18       27      36      45

The following sorts the columns (`axis=1`) of the DataFrame in a descending order:

In [68]:
mt.sort_index(axis=1, ascending=False)

     byTwo  byThree  byOne  byFour  byFive
x1       2        3      1       4       5
x2       4        6      2       8      10
x3       6        9      3      12      15
x4       8       12      4      16      20
x5      10       15      5      20      25
x6      12       18      6      24      30
x7      14       21      7      28      35
x8      16       24      8      32      40
x9      18       27      9      36      45
x10     20       30     10      40      50

Here is how to sort the values a given a column

In [69]:
mt.sort_values('byThree', ascending=False)

     byOne  byTwo  byThree  byFour  byFive
x10     10     20       30      40      50
x9       9     18       27      36      45
x8       8     16       24      32      40
x7       7     14       21      28      35
x6       6     12       18      24      30
x5       5     10       15      20      25
x4       4      8       12      16      20
x3       3      6        9      12      15
x2       2      4        6       8      10
x1       1      2        3       4       5

and here is how to sort the values of a given row

In [70]:
mt.sort_values('x5', ascending=True, axis=1)

     byOne  byTwo  byThree  byFour  byFive
x1       1      2        3       4       5
x2       2      4        6       8      10
x3       3      6        9      12      15
x4       4      8       12      16      20
x5       5     10       15      20      25
x6       6     12       18      24      30
x7       7     14       21      28      35
x8       8     16       24      32      40
x9       9     18       27      36      45
x10     10     20       30      40      50

### Saving a DataFrame to a csv file

In [71]:
mt.to_csv("mt.csv", index=False)

### Reading from a csv file

In [72]:
new_mt = pd.read_csv("mt.csv")
new_mt

   byOne  byTwo  byThree  byFour  byFive
0      1      2        3       4       5
1      2      4        6       8      10
2      3      6        9      12      15
3      4      8       12      16      20
4      5     10       15      20      25
5      6     12       18      24      30
6      7     14       21      28      35
7      8     16       24      32      40
8      9     18       27      36      45
9     10     20       30      40      50

## EXERCISE
Do Exercise 1 - Part B